ZDarow/dq-dsp/dq-dsp-firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash (8MB for N8)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM disabled — board has no usable external RAM
# CONFIG_SPIRAM is not set

# Bluetooth disabled — control transport is Web Serial via UART bridge
CONFIG_BT_ENABLED=n

# USB (native on ESP32-S3)
CONFIG_ESP_PHY_ENABLE_USB=y

# Console via UART bridge (frees USB-OTG GPIO19/20 for TinyUSB UAC audio)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# USB Audio Class (UAC) — stereo speaker, macOS compatible, 24-bit / 96 kHz
CONFIG_UAC_SPEAKER_CHANNEL_NUM=2
CONFIG_UAC_SAMPLE_RATE=48000
CONFIG_UAC_BIT_DEPTH_24=y
CONFIG_UAC_SUPPORT_MACOS=y

# USB descriptor strings — what the host shows in the audio picker
CONFIG_UAC_TUSB_MANUFACTURER="DQ-DSP"
CONFIG_UAC_TUSB_PRODUCT="DQ-DSP"

# Performance
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
